[
    {
        "theme_name": "Mario",
        "description": "Mario (Japanese: マリオ; /mɑːrioʊ/, /mærioʊ/) is a character created by the Japanese game designer Shigeru Miyamoto. He is the star of the Mario franchise, a recurring character in the Donkey Kong franchise, and the mascot of the Japanese video game company Nintendo. Mario is an Italian plumber who lives in the Mushroom Kingdom with his younger twin brother, Luigi. Their adventures generally involve rescuing Princess Peach from the villain Bowser while using power-ups that give them different abilities. Mario's distinctive characteristics include his large nose and mustache, overalls, red cap, and high-pitched, exaggerated Italian accent.\n Mario debuted as the player character of Donkey Kong, a 1981 platform game. Miyamoto created Mario after he was unable to obtain the license to use Popeye as the protagonist. The graphical limitations of arcade hardware influenced Mario's design, such as his nose, mustache, and overalls, and he was named after Nintendo of America's landlord, Mario Segale. After Donkey Kong, Mario starred in Mario Bros. (1983). Its 1985 Nintendo Entertainment System sequel, Super Mario Bros., began the successful Super Mario platformer series. Charles Martinet voiced Mario from 1991 to 2023, when he was succeeded by Kevin Afghani.\n Mario has appeared in over 200 video games. These include puzzle games such as Dr. Mario, role-playing games such as Paper Mario and Mario & Luigi, and sports games such as Mario Kart and Mario Tennis. He lacks a set personality and consistent profession, allowing him to take on many different roles across the Mario franchise. Mario is often accompanied by a large cast of supporting characters, including friends like Princess Daisy, Toad, and Yoshi and rivals like Bowser Jr., Donkey Kong, and Wario. Mario has also appeared in other Nintendo properties, such as the Super Smash Bros. series of crossover fighting games.\n Mario is an established pop culture icon and is widely considered the most famous video game character in history. His likeness has been featured in merchandise, and people and places have been nicknamed after him. He inspired many video game characters, including Sega's Sonic the Hedgehog, and unofficial media. The Mario franchise is the bestselling video game franchise of all time, with more than 800 million units sold worldwide. Mario has been adapted in various media; he was portrayed by Bob Hoskins in the live-action film Super Mario Bros. (1993) and voiced by Chris Pratt in the animated film The Super Mario Bros. Movie (2023).\n Shigeru Miyamoto created Mario while developing Donkey Kong in an attempt to produce a successful video game for Nintendo; previous games, such as Sheriff, had not achieved the success of games such as Namco's Pac-Man. Originally, Miyamoto wanted to create a game that used the 1930s characters Popeye, Bluto, and Olive Oyl. At the time, however, as Miyamoto was unable to acquire a license to use the characters (and would not until 1982 with Popeye), he ended up creating an unnamed player character, along with Donkey Kong and Lady (later known as Pauline).\n In the early stages of Donkey Kong, Mario was drawn using pixel dots in a 16x16 grid. The focus of the game was to escape a maze, while Mario could not jump. However, Miyamoto soon introduced jumping capabilities for the player character, reasoning that \"If you had a barrel rolling towards you, what would you do?\" Continuing to draw from 1930s media, King Kong served as an inspiration, and Mario was set in New York City.\n Though the protagonist was unnamed in the Japanese release of Donkey Kong, he was named \"Jumpman\" in the game's English instructions and \"little Mario\" in the sales brochure. Miyamoto envisioned a \"go-to\" character he could use in any game he developed if needed, albeit in cameo appearances as Miyamoto did not, at the time, expect the character to become singularly popular. To this end, he originally named the character \"Mr. Video\", comparing what he intended for the character's appearances in later games to the cameos that Alfred Hitchcock had done within his films. In retrospect, Miyamoto commented that if he had named Mario \"Mr. Video\", Mario likely would have \"disappeared off the face of the Earth.\"\n According to a widely circulated story, during the localization of Donkey Kong for American audiences, Nintendo of America's warehouse landlord, Mario Segale, confronted then-president Minoru Arakawa, demanding back rent. Following a heated argument in which the Nintendo employees eventually convinced Segale he would be paid, they opted to name the character in the game Mario after him. This story is contradicted by former Nintendo of America warehouse manager Don James, who stated in 2012 that he and Arakawa named the character after Segale as a joke because Segale was so reclusive that none of the employees had ever met him. James repeated this account in 2018. A friend of Segale commented: \"My direct understanding and perception is that Mario Segale doesn't mind at all the fact that his name inspired such an iconic character, and that he shows humble pride in that fact in front of his grandchildren and close-knit adult circles.\"\n While it is implied by the title of the Mario Bros. series, in a 1989 interview, his full name was stated not to be \"Mario Mario\". The first notable use of \"Mario Mario\" was in the 1993 live-action film adaptation of the Super Mario series, and was further used in Prima's official video game strategy guides, in 2000 for Mario Party 2 and in 2003 for Mario & Luigi: Superstar Saga. In 2012, after Mario voice actor Charles Martinet stated that the character's name was, in fact, \"Mario Mario\" at San Diego Comic-Con, Nintendo CEO Satoru Iwata said Mario had no last name, with which Miyamoto agreed the month after. Two months after Iwata's death in July 2015, Miyamoto changed his stance, asserting at the Super Mario Bros. 30th Anniversary festival that Mario's full name was indeed \"Mario Mario\". Mario can also be referred to as \"Super Mario\" when he acquires the Super Mushroom power-up.\n By Miyamoto's own account, Mario's profession was chosen to fit with the game design: since Donkey Kong takes place on a construction site, Mario was made into a carpenter; and when he appeared again in Mario Bros., it was decided that he should be a plumber, because a lot of the game is situated in underground settings. Mario's character design, particularly his large nose, draws on Western influences; once he became a plumber, Miyamoto decided to \"put him in New York\" and make him Italian, light-heartedly attributing Mario's nationality to his mustache. Other sources have Mario's profession chosen to be carpentry in an effort to depict the character as an ordinary hard worker, making it easier for players to identify with him. After a colleague suggested that Mario more closely resembled a plumber, Miyamoto changed Mario's profession accordingly and developed Mario Bros., featuring the character in the sewers of New York City.\n Due to the graphical limitations of arcade hardware at the time, Miyamoto clothed the character in red overalls and a blue shirt to contrast against each other and the background, making the movements of his arms easily perceptible. A red cap was added to let Miyamoto avoid drawing the character's hairstyle, forehead, and eyebrows, as well as to circumvent the issue of animating his hair as he jumped. To give distinctly human facial features with the limited graphical abilities, Miyamoto drew a large nose and a mustache, which avoided the need to draw a mouth and facial expressions. Omitting a mouth circumvented the problem of clearly separating the nose from the mouth with a limited number of pixels available.\n Over time, Mario's appearance has become more defined; blue eyes, white gloves, brown shoes, a red \"M\" in a white circle on the front of his hat and gold buttons on his overalls have been added. According to an interview, Japanese character designer Yōichi Kotabe, who worked on redesigning characters in Super Mario Bros. (1985), revealed that Mario's M on his hat was originally the resemblance of McDonald's logo; Kotabe later changed the design of M and straightened its lines to clearly distinguish the difference. The colors of his shirt and overalls were also reversed from a blue shirt with red overalls to a red shirt with blue overalls. Miyamoto attributed this process to the different development teams and artists for each game as well as advances in technology.\n Mario was voiced by Charles Martinet from 1991 to 2023. When he crashed the audition, the directors were preparing to close for the night, already packing up when he arrived. He was prompted with \"an Italian plumber from Brooklyn\"; when he heard the phrase, he immediately thought of a stereotypical Italian accent with a voice similar to that of a mobster. He then assumed the voice would be too harsh for children, so he planned on using a voice of an older figure. However, according to Martinet, the audition for Mario was the only time where his thoughts crashed and he spoke complete nonsense. After he was prompted the character, he babbled the following in a soft and friendly voice instead:\n The voice he chose was derived from another voice role he used to play the character Gremio from William Shakespeare's The Taming of the Shrew. Martinet kept speaking with the voice until the audition tape ran out; the clip was the only tape sent back to Nintendo, and when the director called the company he said he \"found our Mario\". For the following years he would use the voice for an attraction at trade shows: small tracking sensors were glued onto his face, and he would voice a 3D model of Mario's head on a television while he remained hidden behind a curtain. When attendees would approach the screen, they could talk and interact with Mario. Due to the long shifts, Stevie Coyle was hired as a voice match to take over during breaks by Martinet's suggestion. The attraction was successful and would be used for five years until Martinet was called by Miyamoto, requesting that he use the voice for a video game.\n His first official video game voice role would be the CD rerelease of Mario Teaches Typing in 1994, but his first major voice acting role was Super Mario 64. He received instructions on the types of sound clips needed from Miyamoto, and Martinet appreciated the fun tone of the game and later called Miyamoto a genius. He would continue to voice other various Mario characters, such as Luigi, Wario, and Waluigi. His time in the studio recording voice clips consisted of \"45 takes of every sound [he] can think of\", according to Martinet at a Q&A in Canada. What time he gives vocals for the game varies, and according to him has ranged from three years before a game's release to one week. The amount of clips varies as well, ranging from one hour of audio to 20. Martinet was recognized by the Guinness World Records for the most roles performed with the same character, at the time one hundred, and is the most of any video game voice actor. As of January 2022, he has voiced Mario in over 150 games and has recorded 5 million audio files with the voice. In an interview, Martinet said he wants to continue voicing the character until he \"drops dead\", or until he can no longer perform the voice accurately. In August 2023, Nintendo announced Martinet would be retiring from the voice role of Mario, though he would continue to promote the franchise as a \"Mario Ambassador\", a brand ambassador position. Voice actor Kevin Afghani succeeded Martinet in Super Mario Bros. Wonder the following October.\n Mario is depicted as a portly plumber who lives in the fictional land of the Mushroom Kingdom with Luigi, his younger, taller brother. The original Mario Bros. depicted Mario and Luigi as Italians in New York, with the television series and films specifying them as originating from the borough Brooklyn. Mario's infancy, in which he was transported by a stork to the Mushroom Kingdom, was first depicted in Super Mario World 2: Yoshi's Island. In a 2005 interview, Miyamoto stated that Mario's physical age was about 24–25 years old, and Nintendo Power stated that his birthday is October 11.\n He wears a long-sleeved red shirt, a pair of blue overalls with yellow buttons, brown shoes, white gloves, and a red cap with a red \"M\" printed on a white circle. In Donkey Kong, he wore a pair of red overalls, and a blue shirt. In Super Mario Bros., he wore a brown shirt with red overalls. He has blue eyes, and, like Luigi, has brown hair, and a dark brown or black mustache. This consistent difference in color is attributed to being a relic from designing the characters for their original platforms, wherein certain features were actively distinguished while others had to be curtailed due to technical limitations.\n Mario's occupation is plumbing, though in the original Donkey Kong games he is a carpenter. Mario has also assumed several other occupations: in the Dr. Mario series of puzzle games, which debuted in 1990, Mario is portrayed as a medical physician named \"Dr. Mario\"; in the Game Boy game Mario's Picross, Mario is an archaeologist; in the Mario vs. Donkey Kong series, Mario is the president of a profitable toy-making company. Mario partakes in sports activities such as tennis and golf in Mario sports games, as well as kart racing in the Mario Kart series. In September 2017, Nintendo confirmed on their official Japanese profile for the character that Mario was no longer considered a plumber, but the statement was changed in March 2018. According to Nintendo, Mario has seven careers, which include plumber, doctor, racer, martial artist, basketball player, baseball player, and soccer player.\n Nintendo's characterization of Mario as a Brooklynite Italian-American has been described as an example of mukokuseki, or \"nationlessness\", with \"roots across [the] three continents\" of Europe, North America, and Japan.\n Mario usually saves Princess Peach and the Mushroom Kingdom and purges antagonists, such as Bowser, from various areas; since his first game, Mario has usually had the role of saving the damsel in distress. Originally, he had to rescue his girlfriend Pauline in Donkey Kong (1981) from Donkey Kong. Despite being replaced as Mario's love interest by Princess Peach in Super Mario Bros., a redesigned Pauline that first appeared in Donkey Kong (1994) has reappeared in the Mario vs. Donkey Kong series, Super Mario Odyssey and the Mario Kart series as a friend of Mario. Mario reprises his role of saving Peach in the Super Mario series, but Mario himself was rescued by Peach in role-reversal in Super Princess Peach. Mario rescued Princess Daisy of Sarasaland in Super Mario Land, but Luigi has since been more linked to her; in Super Smash Bros. Melee, the text explaining Daisy states that \"After her appearance in Mario Golf, some gossips started portraying her as Luigi's answer to Mario's Peach.\"\n Luigi is Mario's younger fraternal twin brother, who is taller, slimmer, and can jump higher than him. He is a companion in the Mario games, and the character whom the second player controls in two-player sessions of many of the video games. Luigi has also occasionally rescued Mario as seen in Mario Is Missing! and the Luigi's Mansion series. Super Mario Land 2: 6 Golden Coins for the Game Boy saw the arrival of Wario, Mario's greedy counterpart and self-declared arch rival, who usually assumes the role of a main antagonist or an antihero. The dinosaur character Yoshi serves as Mario's steed and sidekick in games such as Super Mario World. Toad is Mario's trusted close friend, who gives him advice and supports him throughout his journey to rescue Princess Peach.\n During the development of Donkey Kong, Mario was known as Jumpman (ジャンプマン, Janpuman). Jumping—both to facilitate level traversal and as an offensive move—is a common gameplay element in Mario games, especially the Super Mario series. By the time Super Mario RPG was released, jumping became such a signature act of Mario that the player was often tasked with jumping to prove to non-player characters that he was Mario. Mario's most commonly portrayed form of attack is jumping to stomp on the heads of enemies, first used in Super Mario Bros. This jump-stomp move may entirely crush smaller enemies on the stage, and usually deal damage to larger ones, sometimes causing secondary effects. Subsequent games have elaborated on Mario's jumping-related abilities. Super Mario World added the ability to spin-jump, which allows Mario to break blocks beneath him. In Super Mario 64, Mario gains new jumping abilities such as a sideways somersault; a ground pound, which is a high-impact downward thrusting motion; and the \"Wall Kick\", which propels him upwards by kicking off walls.\n Super Mario Bros. introduced the basic three power-ups that have become staples for the series, especially the 2D games – the Super Mushroom, a large red mushroom, which causes Mario to grow larger and be able to survive getting hit once; the Fire Flower, which allows Mario to throw fireballs; and the Super Star, which gives Mario temporary invincibility. These powers have appeared regularly throughout the series.\n Mario is the protagonist of the Super Mario series. Each game varies in its plot, but most of them have the ultimate goal of Mario rescuing Princess Peach after being kidnapped by Bowser. Mario explores a variety of locations, titled \"worlds\", and along the way, he can collect items and defeat enemies. Most levels have an end goal, such as stars or flagpoles, that he needs to reach to move on to the next. The series is divided into two general sets of games: the 2D side-scrolling Super Mario games and the 3D open world Super Mario games.\n The Super Mario series had Mario starring in platform games, beginning with Super Mario Bros. on the Nintendo Entertainment System (NES) in 1985. In these games, Mario traverses worlds that contain a set number of levels for Mario to complete. In them, he traverses them from moving left to right, the screen scrolling in the direction he moves. Mario has the goal of reaching the end of the level to move onto the next, typically marked with a flagpole. These games are less focused on plot and more on platforming; most commonly, Bowser kidnaps Peach, and Mario, with the help of Luigi and other characters, sets out to rescue her. Most worlds have mini boss battles, which typically involve fighting Bowser Jr. or one of several Koopalings. The final level is a fight against Bowser.\n His first appearance in the 2D variant of the series was Super Mario Bros. in 1985, which began with a 16x32 pixel rectangle prototype as the character; Takashi Tezuka suggested the character to be Mario after the success of one of his previous roles, Mario Bros. Certain other gameplay concepts were cut as well, such as how Mario could fly in a rocket ship and fire bullets. Originally designed with a small Mario in mind with the intention of increasing his size further in development, the developers implemented the feature of his size changes via power-ups as they considered it a fun addition. The concept was influenced by Japanese folktales.\n Super Mario Bros. 2 was originally not going to be a sequel to Super Mario Bros., and was originally going to be a game called Doki Doki Panic; directed by Kensuke Tanabe. One of the changes included the retexturing of the four main playable characters of Doki Doki Panic, and since they varied in height, this was the first instance where Mario was noticeably shorter than Luigi. Super Mario Bros. 3 experimented with Mario's looks with different power-ups that represented different creatures. An example included the raccoon tail, which was chosen over a power-up that represented a centaur. The game's success led to an animated television series, The Adventures of Super Mario Bros. 3, with Mario being portrayed by Walker Boone.\n Hiroshi Yamauchi wanted a launch game for the Game Boy that featured Mario, as he believed in the statement \"fun games sold consoles\". Super Mario Land was designed without the help of Miyamoto, a first for the series. The game uses completely different elements to pair with the small screen due to the Game Boy's portability. For example, instead of rescuing Princess Peach from Bowser in the Mushroom Kingdom, Mario is instead rescuing Princess Daisy from Tatanga in Sarasaland. Mario was designed with line art.\n Super Mario World was the first video game to feature Yoshi as a companion to Mario. Miyamoto had always wanted a dinosaur-like companion, ever since the original Super Mario Bros., but the concept was never achievable due to limited hardware. Since Super Mario World took place in a land of dinosaurs, Takashi Tezuka requested Shigefumi Hino to draw a character based on Miyamoto's concepts and sketches, which he drew during the development of Super Mario Bros. 3. Super Mario World was released during a console war between Nintendo and Sega; Sega's mascot, Sonic the Hedgehog, was considered a \"cooler\" alternative to Mario, to which Miyamoto apologized for.\n The plot for Super Mario Land 2: 6 Golden Coins has Mario pursue something for his own benefit rather than for someone else, his goal trying to reclaim ownership of his island, Mario Land, from Wario. The game was developed by Nintendo Research & Development 1 (R&D1). The company was unmotivated by the Super Mario series, and when they were tasked with creating a Super Mario game without Miyamoto, they created Wario to emphasize the frustration of working with a character they did not make. The name \"Wario\" is word play of \"Mario\" and \"Warui\", the latter meaning \"bad\" in Japanese to mean \"bad Mario\".\n The character's models and backgrounds in New Super Mario Bros. were 3D, but still only allowed for left and right movement and are considered 2.5D. With the 2D series of Super Mario games being absent for 14 years, the previous installment being released in 1992, game mechanics improved drastically. Since the characters were no longer sprites and the backdrops were not tile-based, the developers were nearly restrictionless; new game mechanics, such as Mario teetering off of trees and swinging on ropes, were implemented. New Super Mario Bros. was the first 2D Super Mario game to use voice acting, with Charles Martinet voicing Mario and Luigi. It was followed by three games similar to New Super Mario Bros., namely New Super Mario Bros. Wii, New Super Mario Bros. 2, and New Super Mario Bros. U, the latter of which being the first game to feature Mario in high-definition graphics (HD).\n Takashi Tezuka returned as a producer for the development of Super Mario Bros. Wonder, with Shiro Mouri as the director of the game. The game director, Shiro Mouri, said that the game developers aimed to provide a \"stress free\" experience to the players by allowing them to move freely through the course. In comparison to the previous 2D Super Mario games, Mario's facial expressions are now more detailed and expressive.\n Most Super Mario games in 3D feature open world gameplay; instead of being confined to only moving left and right, Mario can move in any direction, and the player can complete the level however they please. The player chooses from one of the multiple objectives before entering a level, and Mario is tasked with completing that goal, which ultimately ends with an obtainable item such as a star. These games feature a more complex narrative, but most still have Mario rescuing a kidnapped Princess Peach from Bowser.\n Mario's debut 3D role was in Super Mario 64; since the concept of 3D video games was still new at the time, the developers knew they were helping to pave the way for future games, and they were not restricted on what the standard game was like. However, when Yoshiaki Koizumi had to create a 3D model and animation of Mario, he had no frame of reference and struggled with the task. Koizumi stated how the whole concept was \"arguably tough\", but was overtaken by the enjoyment of innovating in a new field. Mario's movement was among the top priorities in the game's development, with his animation being tested long before the basic layout of the game's locations was in place. Super Mario 64 was one of the first games voiced by Charles Martinet, and Mario's character model was made with the N-World toolkit. Mario's movements and animations were inspired by Arale Norimaki from Dr. Slump, a Japanese manga series.\n Super Mario Sunshine was the first Nintendo game released after Satoru Iwata became the CEO of Nintendo, succeeding Hiroshi Yamauchi. The game's original concept did not feature Mario, as the developers believed the role was too out of the ordinary for such a character. Later on, when they used a generic man for the role instead, they believed having a realistic person alongside a character like Mario would cause \"incongruity\", and it was ultimately changed to Mario instead. Mario's ally, F.L.U.D.D., was one of ten design options but was chosen because it fit the game's theme, although it was not their favorite option in terms of looks.\n Super Mario Galaxy had Mario exploring a number of spherical planets, which the developers at the time knew simply jumping on enemies would be difficult to perform. They instead took advantage of the Wii Remote and Nunchuk having motion controls, and gave Mario a \"spin\" attack where he knocked over the enemies via spinning. To also balance the game's difficulty, Mario was given fewer hit points.\n To create a sense of familiarity for Super Mario Odyssey, various references to the Super Mario series were put in the game's environment. For example, Pauline was chosen to be a major aspect of the \"Metro Kingdom\" due to the kingdom representing the core of the game. Mario was also given a variety of costumes to represent other smaller games, such as the Mario's Picross series. The development team found the most fun way to use the Joy-Con controllers' motion controls was to throw a hat, and the gameplay was centered around Mario throwing his cap.\n There have also been a variety of Super Mario games starring Mario that do not have typical 2D or 3D platforming. The Super Mario 3D series does have 3D gameplay, but the stages are linear and do not allow for open-world movement. The Super Mario Maker games are a series of game creation systems where the player can create their own 2D Super Mario levels and play ones created by others. Super Mario Run is a 2D platforming mobile game with other unnatural gameplay aspects.\n The main aspect of Super Mario 3D Land was bridging the aspects of 2D and 3D Super Mario games. One of the issues brought up was how Mario looked too small in comparison to the large terrain and the small, portable screen of the Nintendo 3DS, so the game's camera system needed to be fixed to one position in certain occasions. The game brought with it the \"Tanooki Tail\" power-up, which was originally introduced in Super Mario Bros. 3, and its existence was teased by the developers to the fans prior to its official announcement. Concepts for Mario, which included a skater outfit and a power-up that would make Mario grow to a large size, were cut; the latter would appear in its sequel as the Mega Mushroom.\n Super Mario 3D World on the Wii U included the \"Cat Mario\" power-up, which was implemented to help newcomers play the game and add new gameplay features such as climbing up walls. Another power-up was the \"Double Cherry\", which was added accidentally; one of the developers added a second Mario into the game in error, and found it humorous when both Marios were somehow controllable at the same time. In 2020, also as part of the Super Mario Bros. 35th anniversary, Nintendo re-released Super Mario 3D World on the Nintendo Switch with a companion game, Bowser's Fury.\n While the most prominent use of Mario has been directed toward the Super Mario series, various spinoff series that split into numerous games covering various genres have also been released. This includes genres such as role-playing games (RPGs), puzzle games, sports games, and even educational games in the 1990s.\n Mario has been the protagonist of various role-playing video games (RPGs), beginning with Square's Super Mario RPG on the Super Nintendo Entertainment System (SNES). According to Yoshio Hongo of Nintendo, the game came out of Shigeru Miyamoto's desire to develop a Mario role-playing game while Square wanted a role-playing video game that sold well overseas. The game was notable at the time for having a unique blend of action and role-playing game elements, and was a critical and commercial success, and led to two other spinoff RPG series starring the character, Paper Mario and Mario & Luigi.\n A sequel to Super Mario RPG was planned for the Nintendo 64. The original developer, Square, had signed a deal with Sony to release Final Fantasy VII for the PlayStation, so Nintendo passed on development responsibilities to Intelligent Systems. The new art designer, Naohiko Aoyama, changed every character to two-dimensional to bring out \"cuter\" graphics compared to low-polygon three-dimensional graphics on the console. In the Paper Mario games, Mario is often aided by numerous allies who progress the story while Mario remains silent.\n Unlike Paper Mario, both Mario and Luigi have voices in the Mario & Luigi series and are voiced by Charles Martinet. According to the developers, the early games used character sprites; the developers were generally inexperienced and did not know much about hardware at the time. Once the Nintendo 3DS was released, the developers had the chance to switch to 3-dimensional graphics. They decided to change the background and world design but chose to keep the characters as 2D renderings of 3D characters as they believed it made it easier to convey comedic expressions. In 2013, they believed Mario took too much of the spotlight in the Mario franchise, and they made Luigi the more story-focused character in Mario & Luigi: Dream Team.\n Nintendo has released a variety of sports games featuring Super Mario properties, which include tennis, golf, baseball, soccer, kart racing, and other miscellaneous.\n In the 1984 video game Golf, although one of the two playable characters looks similar to that of him, wearing red clothes and black pants, he is never directly referred to be Mario; In 1997, his look was changed in the re-release of the Famicom Disk System to that more like the character, and Nintendo later confirmed the character was Mario in a guide book of the game in 1991, marking his first sports video game appearance. He then directly appeared in NES Open Tournament Golf in 1991 as one of two playable characters, the other being Luigi, along with a variety of other Mario characters with supporting roles. The character sprites were designed by Eiji Aonuma, his first project in graphical art design.\n Mario's Tennis for the Virtual Boy was the first tennis game featuring Mario. Camelot Software Planning, who previously developed Everybody's Golf for Sony, was contracted to develop Mario Tennis for the Nintendo 64. Each character had a unique ability, with Mario having an all-around average set of skills to pair with his type of character. This would eventually set the stage for future Mario Tennis video games.\n The Mario Kart franchise began with Super Mario Kart for the Super Nintendo Entertainment System in 1992; early in development, the game did not have any Mario-themed elements. A few months into the process, the designers were testing how one character would look at another they had just passed. They implemented Mario, simply to see how he would look inside a kart, and the original concept was scrapped entirely after they decided he looked better than the previous non-defined characters. Similar to the Mario & Luigi series, he appears as a sprite that turns in 16 different angles.\n Mario & Sonic at the Olympic Games is a crossover series of party and sports games featuring characters from the Mario franchise and the Sonic the Hedgehog series. It includes different varieties of sports such as skateboarding, fencing, volleyball, gymnastics, and many others.\n Mario has also starred in a variety of multiple puzzle games, but sometimes only makes an appearance and is not playable. The first of which to release was Wrecking Crew, designed by Yoshio Sakamoto. Surprisingly, in this game, Mario can't jump because of hammer's weight. After which, three main series and a variety of spin-offs were released starring him, including Dr. Mario, Mario vs. Donkey Kong, and Mario Picross.\n The original game in the Dr. Mario series, also titled Dr. Mario, was designed by Takahiro Harada and had Mario assume the role of a doctor instead of a plumber. His appearance and role have generally remained the same; to celebrate his 30th anniversary in the series, an 8-bit rendering of his original appearance was made unlockable in the most recent game, Dr. Mario World. Mario vs. Donkey Kong is centered around \"Mini Marios\", wind-up toys that resemble Mario. The Mario's Picross series was an attempt by Nintendo to capitalize on the popularity of Mario and the success of puzzle games in Japan at the time. Released in 1995, the game was popular and was followed by two sequels, Super Mario Picross and Picross 2, but the first game was only made available to American audiences in 2020.\n Due to the abandonment of the SNES-CD hardware in the 1990s, a project developed by Nintendo and Phillips, as part of Nintendo's dissolving agreement with Philips, they gave the licensing rights to Mario and The Legend of Zelda property to release games on the CD-i. Multiple games were developed by the inexperienced Fantasy Factory, which included the puzzle game Hotel Mario in 1994. Via Animation Magic, Hotel Mario had various cutscenes of Mario and Luigi, which borrowed animation elements from Disney and J. R. R. Tolkien. Mario was voiced by Marc Graue as the game was released prior to Charles Martinet receiving the role of voicing the character.\n Due to the popularity of the Super Mario series, various educational games starring the character were released and appealed to younger audiences. These games had little involvement from Nintendo, with the games releasing for the NES, Super Nintendo Entertainment System (SNES), and personal computers. The last of the genres to release was Mario Teaches Typing 2 in 1997, before the production of such games was discontinued.\n Mario is Missing! is one of the only occasions where Mario himself was kidnapped and rescued by another character. In the game, Mario and Luigi approach Bowser to stop his plans, but Mario is then captured; Luigi traverses real-world locations to follow after him, solving trivia along the way. A similar game was released without the help of Miyamoto, Mario's Time Machine, which starred Mario against Bowser instead. Mario's Game Gallery has the player competing in various card and board games against Mario. The game was Charles Martinet's first official voice acting role for Mario, one year prior to Super Mario 64.\n For Mario Teaches Typing, the head of Interplay Productions, Brian Fargo, saw the success of the typing game Mavis Beacon Teaches Typing, and knew a character like Mario as the teacher would be appealing. Pre-dating Mario's Game Gallery, Martinet did not voice Mario. After release, the concept was so successful, it began a negative relationship between Fargo and Les Crane, the creator of Mavis Beacon Teaches Typing. Mario Teaches Typing 2 was released in 1997, which Martinet voiced Mario for. When they were approved of creating Mario's Game Gallery, another Mario-themed education game was also released that was of poor quality, so Miyamoto met with Fargo and halted production of any further education games using the character.\n Apart from his platformer and spin-off game appearances, Mario has made guest appearances in other Nintendo games, such as Mike Tyson's Punch-Out!! and Tennis (1984), where Mario is an umpire, in Pac-Man Vs., he is the in-game announcer. Mario appears alongside Pauline in a bonus segment in Pinball (1984). He also appears as a playable character in every installment of the Super Smash Bros. series. He makes countless cameo appearances in many forms in many games, such as portraits and statues in The Legend of Zelda: A Link to the Past, The Legend of Zelda: Majora's Mask, The Legend of Zelda: Ocarina of Time, Pilotwings 64, and Stunt Race FX. Mario has a cameo appearance in Donkey Kong Country 2: Diddy's Kong Quest, despite having next to no presence in the Donkey Kong Country subseries. He can be seen in a crowd along with Luigi in Kirby Super Star. On an ending screen that appears in Nintendo's NES version of the video game Tetris, Mario appears with Luigi dancing to the music, which is a version from prelude to the opera Carmen; Peach, Bowser and various Nintendo characters also appear.\n Outside of Nintendo-produced games, Mario has often appeared in third-party games on Nintendo consoles. Mario appears in Metal Gear Solid: The Twin Snakes as a figurine alongside Yoshi. Mario appears as a playable character in the GameCube versions of NBA Street V3  and SSX on Tour. Mario also appeared in Minecraft as a skin alongside other characters in the series. Monster Hunter 4 included Mario as one of the free DLC outfits alongside Luigi. The Wii U version of Scribblenauts Unlimited features Mario along with other Super Mario and The Legend of Zelda characters; they are not present in the 3DS version of the game. In December 2011, Ubisoft's Just Dance 3 included \"Mario\" as a downloadable dance track, with Mario appearing to dance on-screen.\n The first appearance of Mario in media other than games was Saturday Supercade, an animated television series produced by Ruby-Spears Productions in 1983. The 1986 original video animation Super Mario Bros.: The Great Mission to Rescue Princess Peach! features Mario (voiced by Toru Furuya) as the protagonist. The animated series The Super Mario Bros. Super Show! features a live-action series of skits that stars former WWF manager \"Captain\" Lou Albano as Mario and Danny Wells as Luigi. Mario appeared in a book series, the Nintendo Adventure Books. The other two animated series, The Adventures of Super Mario Bros. 3 and Super Mario World, star Walker Boone as Mario and Tony Rosato as Luigi.\n Mario is portrayed by Bob Hoskins in the 1993 film loosely based on the Super Mario series, Super Mario Bros. In the film, he is the cynical older brother who takes great pride in being a plumber and is a parental figure to Luigi, portrayed by John Leguizamo. At first, he held no belief in unusual things happening, but meeting Daisy and taking a trip to Dinohattan soon changed his mind. Hoskins was ultimately cast to play the character after other choices fell out, such as Dustin Hoffman and Danny DeVito. Hoskins had previously done multiple roles in children's films and kept suggesting changes to the script before he agreed to portray the character. According to one of the films' directors, Annabel Jankel, Hoskins was mainly considered due to his physical appearances. In subsequent interviews, Hoskins considered the role his worst choice in his acting career, admitted to constantly drinking before and during filming, and noted that he was injured and almost died multiple times during production.\n Mario is voiced by Chris Pratt in the 2023 film adaptation The Super Mario Bros. Movie. Although American actor Sebastian Maniscalco originally auditioned to voice Mario in the 2023 film, he got the role of voicing Spike instead. The film depicts him and Luigi as Italian-American plumbers who started their own business in Brooklyn after working for the antagonistic Foreman Spike, who supervises the Wrecking Crew. They attempt to fix a significant manhole leak reported in the news to make a name for themselves, only for the pipe to transport Mario to the Mushroom Kingdom and Luigi to the Dark Lands. Mario works with Peach, Toad, and later Donkey Kong to rescue Luigi and the Mushroom Kingdom from the tyrannical Bowser. Martinet makes cameo appearances in the film as Mario and Luigi's unnamed father and as Giuseppe, who appears in Brooklyn and resembles Mario's original design from Donkey Kong, speaking in his in-game voice. In response to criticism of Pratt's casting, co-director Aaron Horvath explained that he was cast mainly because of his history of playing good-natured, blue collar-type protagonists.\n As Nintendo's mascot, Mario is widely considered to be the most famous video game character in history, and has been called an icon of the gaming industry. He has been featured in over two hundred video games. Mario was one of the first video game character inductees at the Walk of Game in 2005, alongside Link and Sonic the Hedgehog. Mario was the first video game character to be honored with a wax figure in the Hollywood Wax Museum in 2003. Kotaku writer Luke Plunkett had called Mario the most recognizable figure in the gaming industry, stating that, \"Nintendo's mascot has been the most recognisable (and profitable) face this industry has ever - and will likely ever - see, almost single-handedly driving Nintendo through five whole generations of video game success\". In 2010, Guinness World Records gave Mario the title \"Godfather of gaming\" and \"longest-running computer game character\" and stated, \"Mario is still 'The Godfather' of gaming as the most successful and enduring character in an industry which is constantly evolving.\" In 2024, a poll conducted by BAFTA with around 4,000 respondents named Mario as the second most iconic video-game character of all time. Ben Lindbergh of The Ringer described Mario as \"the most iconic video character of all time\", \"the medium's most successful character\", and \"video-game-character equivalent of type-O blood\" and also reported that Mario has the highest Q Score among video game characters, with Link, Pac-Man, and Master Chief being one of his closest competitors. Lucas M. Thomas of IGN defined Mario as \"gaming's greatest athlete\", noting, \"He's too short, he's out of shape and he's wearing entirely the wrong kind of shoes, but somehow Nintendo's main man Mario has still managed to become gaming's greatest athlete. From the tennis court to the ballpark, from the soccer field to the golf course, the heroic plumber has spent years now filling the time in-between his princess-rescuing adventures with a grand variety of leisurely sports\".\n In 1990, a national survey found that Mario was more recognizable to American children than Mickey Mouse. James Coates of The Baltimore Sun reported that, as author David Sheff notes, \"In 1990, according to ‘Q’ ratings, Mario has become more popular than Mickey Mouse with American children\" and he further mentions that his 9-year-old son is a Nintendo fan who is curious about what Mario is doing to the youth of America. In 2005, American musician Jonathan Mann created an opera based on Super Mario Bros. and performed Mario Opera as a tribute to Shigeru Miyamoto. Salman Rushdie, an Indian-born British-American novelist, was fond of Mario and his younger twin brother Luigi. He also enjoyed playing Super Mario World, which gave him the impression of having an enjoyment of life in comparison to the rest of the world. In 2023, a survey was taken by gaming website Cribbage Online on \"Top 20 most-loved \"Super Mario\" franchise characters\", which consisted of over 87,000 voters. According to the survey, Mario was placed third with 5,602 votes, while Luigi and Yoshi surpassed him with 5,771 votes and 6,084 votes, respectively.\n Cameron Sherrill of Esquire praised Mario's athletic skills in track and field, noting, \"This is where Mario comes to life. I mean, he goes against the blue guy who's literally famous for going fast. Plus, Mario is the platforming king—i.e. running and jumping—so it stands to reason that he’d be good at track and field\". Philip Kollar and Allegra Frank of Polygon wrote in their review of Super Mario Odyssey that Mario plays an important role in making the game more pleasurable and special. They also wrote about Mario's legacy, stating that, \"From a plumber to a doctor to a tennis star to, uh, a Goomba, Mario has endured. No, this will not be the last Mario game, but it is almost certain to be lauded as one of his best\". Electronic Gaming Monthly gave Mario their \"Coolest Mascot\" award for 1996, calling him \"an age-old friend\". Nintendo Power listed Mario as their favorite hero, citing his defining characteristics as his mustache, red cap, plumbing prowess, and his mushrooms. In a poll conducted in 2008 by Oricon, Mario was voted as the most popular video game character in Japan by both men and women, overtaking popular video game icons such as Final Fantasy's Cloud Strife and Metal Gear's Solid Snake. Yahoo! Japan held a poll between November 1, 2009, and October 31, 2010, to determine which video game character is more popular among readers. Mario won the poll with 9,862 votes. Several publications have often compared Mario to Sega's mascot and iconic character, Sonic the Hedgehog. Mario also serves as an inspiration for Sonic the Hedgehog's origin.\n Mario has been established as a pop culture icon and has appeared on lunch boxes, T-shirts, magazines, and commercials (notably in a Got Milk? commercial). Other products include cartoon shows, movies, books, hats, plush dolls, cereals, ice cream, bedding, kitchenware, clocks, purses, cufflinks, wallets, mugs, art prints, boxers, Lego sets, coaster sets, Hot Wheels sets, stationery sets, and board games.\n Mario has inspired unlicensed paintings, performances on talent shows such as India's Got Talent, short films, and web series. The character has been present in a number of works created by third parties other than Nintendo, such as in the iOS and Android video game Platform Panic, in which one of the purchasable skins is a reference to him. Assassin's Creed II, an action-adventure video game created by Ubisoft, features a reference to the Super Mario series. The game's protagonist, Ezio Auditore da Firenze, gets attacked on the road; his uncle saves him and introduces himself by saying Mario's iconic catchphrase, \"It's a-me, Mario!\" World of Warcraft, a massively multiplayer online role-playing game created by Blizzard Entertainment, features two non-playable characters named Muigin and Larion, who are references to Mario and Luigi. It also features a jumpbot that resembles Mario's appearance.\n Many people and places have been named or nicknamed after Mario. Bergsala, the distributor of Nintendo's products in the Nordic and the Baltic countries, is located at Marios Gata 21 (Mario's Street 21) in Kungsbacka, Sweden, named after Mario. Many sports stars, including Bundesliga football players Mario Götze and Mario Gómez, National Hockey League player Mario Lemieux, Italian footballer Mario Balotelli, Italian cyclist Mario Cipollini, and American former footballer Mario Williams have been given the nickname \"Super Mario\". In a suburb of the Spanish city of Zaragoza, streets were named after video games, including \"Avenida de Super Mario Bros.\"\n Mario's legacy is recognized by Guinness World Records, who awarded the Nintendo mascot, and the series of platform games he has appeared in, seven world records in the Guinness World Records: Gamer's Edition 2008. These records include \"Best Selling Video Game Series of All Time\", \"First Movie Based on an Existing Video Game\", and \"Most Prolific Video Game Character\", with Mario appearing in 116 original games. In 2009, Guinness World Records listed him as the second most recognizable video game character in the United States, recognized by 93 percent of the population, second only to Pac-Man, who was recognized by 94 percent of the population. In 2011, readers of Guinness World Records Gamer's Edition voted Mario as the top video game character of all time. In 2018, Charles Martinet, voice actor of Mario, received the Guinness World Record for most video game voice-over performances as the same character.\n Mario appeared in the 2016 Summer Olympics closing ceremony to promote the 2020 Summer Olympics in Tokyo. In a pre-recorded video, the prime minister Shinzo Abe became Mario to use a Warp pipe planted by Doraemon from Shibuya Crossing to Maracanã Stadium. Abe then appeared dressed as Mario in an oversized Warp Pipe in the middle of the stadium. This segment was favorably well received as playful and tasteful in Japan, resulting in giving Abe the nickname \"Abe-Mario\".\n Mario Day is celebrated on March 10, as when that date is presented as Mar 10 it resembles the word \"Mario\". Since 2016 the day has been officially observed by Nintendo, who celebrates the day annually by promoting Mario games and holding Mario-related events. In March 2018, Google Maps collaborated with Nintendo for the celebration of Mario Day. By tapping on a yellow ? Block, the navigation arrow changes into Mario, who drives his Pipe Frame kart from the Mario Kart series. In March 2024, American actor Gaten Matarazzo teamed up with Nintendo to celebrate that year's Mario Day.\n",
        "source_url": "https://en.wikipedia.org/wiki/Mario"
    },
    {
        "theme_name": "Halloween",
        "description": "Halloween, or Hallowe'en (less commonly known as Allhalloween, All Hallows' Eve, or All Saints' Eve), is a celebration observed in many countries  on 31 October, the eve of the Western Christian feast of All Hallows' Day. It is at the beginning of the observance of Allhallowtide, the time in the liturgical year dedicated to remembering the dead, including saints (hallows), martyrs, and all the faithful departed. In popular culture, the day has become a celebration of horror and is associated with the macabre and the supernatural.\n One theory holds that many Halloween traditions were influenced by Celtic harvest festivals, particularly the Gaelic festival Samhain, which are believed to have pagan roots. Some go further and suggest that Samhain may have been Christianized as All Hallows' Day, along with its eve, by the early Church. Other academics say Halloween began independently as a Christian holiday, being the vigil of All Hallows' Day. Celebrated in Ireland and Scotland for centuries, Irish and Scottish immigrants took many Halloween customs to North America in the 19th century, and then through American influence various Halloween customs spread to other countries by the late 20th and early 21st century.\n Popular activities during Halloween include trick-or-treating (or the related guising and souling), attending Halloween costume parties, carving pumpkins or turnips into jack-o'-lanterns, lighting bonfires, apple bobbing, divination games, playing pranks, visiting haunted attractions, telling frightening stories, and watching horror or Halloween-themed films. Some people practice the Christian observances of All Hallows' Eve, including attending church services and lighting candles on the graves of the dead, although it is a secular celebration for others. Some Christians historically abstained from meat on All Hallows' Eve, a tradition reflected in the eating of certain vegetarian foods on this vigil day, including apples, potato pancakes, and soul cakes.\n",
        "source_url": "https://en.wikipedia.org/wiki/Halloween"
    },
    {
        "theme_name": "Fortnite",
        "description": "Fortnite is an online video game and game platform developed by Epic Games and released in 2017. It is available in six distinct game mode versions that otherwise share the same general gameplay and game engine: Fortnite Battle Royale, a free-to-play battle royale game in which up to 100 players fight to be the last person standing; Fortnite: Save the World, a cooperative hybrid tower defense-shooter and survival game in which up to four players fight off zombie-like creatures and defend objects with traps and fortifications they can build; Fortnite Creative, in which players are given complete freedom to create worlds and battle arenas; Lego Fortnite, an open world survival game; Rocket Racing, a racing game; and Fortnite Festival, a rhythm game.\n Save the World and Battle Royale were released in 2017 as early access titles, while Creative was released on December 6, 2018.\nWhile the Save the World and Creative versions have been successful for Epic Games, Fortnite Battle Royale in particular became an overwhelming success and a cultural phenomenon, drawing more than 125 million players in less than a year, earning hundreds of millions of dollars per month. Fortnite as a whole generated $9 billion in gross revenue up until December 2019, and it has been listed among the greatest games of all time.\n Save the World is available for macOS,[c] PlayStation 4, Windows, and Xbox One, while Battle Royale and Creative were released for all those platforms as well as Android and iOS devices[c] and Nintendo Switch. The game also launched with the release of the ninth-generation PlayStation 5 and Xbox Series X/S consoles. Furthermore, Lego Fortnite, Rocket Racing and Fortnite Festival are available on all platforms.\n",
        "source_url": "https://en.wikipedia.org/wiki/Fortnite"
    },
    {
        "theme_name": "Christmas",
        "description": "Christmas is an annual festival commemorating the birth of Jesus Christ, observed primarily on December 25[a] as a religious and cultural celebration among billions of people around the world. It is a feast central to Christianity. In the liturgical year, preparation for Christmas begins on the First Sunday of Advent (the fourth Sunday before), and it is followed by Christmastide, which historically in the West lasts twelve days and culminates on Twelfth Night. Christmas Day is a public holiday in many countries, is celebrated religiously by a majority of Christians, as well as culturally by many non-Christians, and forms an integral part of the holiday season surrounding it.\n The traditional Christmas narrative recounted in the New Testament, known as the Nativity of Jesus, says that Jesus was born in Bethlehem, in accordance with messianic prophecies. When Joseph and Mary arrived in the city, the inn had no room, and so they were offered a stable where the Christ Child was soon born, with angels proclaiming this news to shepherds, who then spread the word.\n There are different hypotheses regarding the date of Jesus's birth. In the early fourth century, the church fixed the date as December 25, the date of the winter solstice in the Roman calendar. It is nine months after Annunciation on March 25, also the Roman date of the spring equinox. Most Christians celebrate on December 25 in the Gregorian calendar, which has been adopted almost universally in the civil calendars used in countries throughout the world. However, part of the Eastern Christian Churches celebrate Christmas on December 25 of the older Julian calendar, which currently corresponds to January 7 in the Gregorian calendar. For Christians, believing that God came into the world in the form of man to atone for the sins of humanity rather than knowing Jesus's exact birth date is considered to be the primary purpose of celebrating Christmas.\n The customs associated with Christmas in various countries have a mix of pre-Christian, Christian, and secular themes and origins. Popular holiday traditions include gift giving; completing an Advent calendar or Advent wreath; Christmas music and caroling; watching Christmas movies; viewing a Nativity play; an exchange of Christmas cards; attending church services; a special meal; and displaying various Christmas decorations, including Christmas trees, Christmas lights, nativity scenes, garlands, wreaths, mistletoe, and holly. Additionally, several related and often interchangeable figures, known as Santa Claus, Father Christmas, Saint Nicholas, and Christkind, are associated with bringing gifts to children during the Christmas season and have their own body of traditions and lore. Because gift-giving and many other aspects of the Christmas festival involve heightened economic activity, the holiday has become a significant event and a key sales period for retailers and businesses. Over the past few centuries, Christmas has had a steadily growing economic effect in many regions of the world.\n The English word Christmas is a shortened form of 'Christ's Mass'. The word is recorded as Crīstesmæsse in 1038 and Cristes-messe in 1131. Crīst (genitive Crīstes) is from the Greek Χριστός (Khrīstos, 'Christ'), a translation of the Hebrew מָשִׁיחַ‎ (Māšîaḥ, 'Messiah'), meaning 'anointed'; and mæsse is from the Latin missa, the celebration of the Eucharist.\n The form Christenmas was also used during some periods, but is now considered archaic and dialectal. The term derives from Middle English Cristenmasse, meaning 'Christian mass'. Xmas is an abbreviation of Christmas found particularly in print, based on the initial letter chi (Χ) in the Greek [Χριστός] Error: {{Lang}}: invalid parameter: |literal= (help), although some style guides discourage its use. This abbreviation has precedent in Middle English Χρ̄es masse (where Χρ̄ is another abbreviation of the Greek word).\n The holiday has had various other English names throughout its history. The Anglo-Saxons referred to the feast as \"midwinter\", or, more rarely, as Nātiuiteð (from the Latin nātīvitās below). Nativity, meaning 'birth', is from the Latin nātīvitās. In Old English, Gēola ('Yule') referred to the period corresponding to December and January, which was eventually equated with Christian Christmas. 'Noel' (also 'Nowel' or 'Nowell', as in \"The First Nowell\") entered English in the late 14th century and is from the Old French noël or naël, itself ultimately from the Latin nātālis (diēs) meaning 'birth (day)'.\n Koleda is the traditional Slavic name for Christmas and the period from Christmas to Epiphany or, more generally, to Slavic Christmas-related rituals, some dating to pre-Christian times.\n The gospels of Luke and Matthew describe Jesus as being born in Bethlehem to the Virgin Mary. In the Gospel of Luke, Joseph and Mary travel from Nazareth to Bethlehem in order to be counted for a census, and Jesus is born there and placed in a manger. Angels proclaim him a savior for all people, and three shepherds come to adore him. In the Gospel of Matthew, by contrast, three magi follow a star to Bethlehem to bring gifts to Jesus, born the king of the Jews. King Herod orders the massacre of all the boys less than two years old in Bethlehem, but the family flees to Egypt and later returns to Nazareth.\n In the 2nd century, the \"earliest church records\" indicate that \"Christians were remembering and celebrating the birth of the Lord\", an \"observance [that] sprang up organically from the authentic devotion of ordinary believers\"; although \"they did not agree upon a set date\". The earliest evidence of Christ's birth being marked on December 25 is a sentence in the Chronograph of 354. Liturgical historians generally agree that this part of the text was written in Rome in AD 336. Though Christmas did not appear on the lists of festivals given by the early Christian writers Irenaeus and Tertullian, the early Church Fathers John Chrysostom, Augustine of Hippo, and Jerome attested to December 25 as the date of Christmas toward the end of the fourth century. December 25 was the traditional date of the winter solstice in the Roman Empire, where most Christians lived, and the Roman festival Dies Natalis Solis Invicti (birthday of Sol Invictus, the 'Invincible Sun') had been held on this date since 274 AD.\n In the East, the birth of Jesus was celebrated in connection with the Epiphany on January 6. This holiday was not primarily about Christ's birth, but rather his baptism. Christmas was promoted in the East as part of the revival of Orthodox Christianity that followed the death of the pro-Arian Emperor Valens at the Battle of Adrianople in 378. The feast was introduced in Constantinople in 379, in Antioch by John Chrysostom towards the end of the fourth century, probably in 388, and in Alexandria in the following century. The Georgian Iadgari demonstrates that Christmas was celebrated in Jerusalem by the sixth century.\n In the Early Middle Ages, Christmas Day was overshadowed by Epiphany, which in western Christianity focused on the visit of the magi. However, the medieval calendar was dominated by Christmas-related holidays. The forty days before Christmas became the \"forty days of St. Martin\" (which began on November 11, the feast of St. Martin of Tours), now known as Advent. In Italy, former Saturnalian traditions were attached to Advent. Around the 12th century, these traditions transferred again to the Twelve Days of Christmas (December 25 – January 5); a time that appears in the liturgical calendars as Christmastide or Twelve Holy Days.\n In 567, the Council of Tours put in place the season of Christmastide, proclaiming \"the twelve days from Christmas to Epiphany as a sacred and festive season, and established the duty of Advent fasting in preparation for the feast.\" This was done in order to solve the \"administrative problem for the Roman Empire as it tried to coordinate the solar Julian calendar with the lunar calendars of its provinces in the east.\"\n The prominence of Christmas Day increased gradually after Charlemagne was crowned Emperor on Christmas Day in 800. King Edmund the Martyr was anointed on Christmas in 855 and King William I of England was crowned on Christmas Day 1066.\n By the High Middle Ages, the holiday had become so prominent that chroniclers routinely noted where various magnates celebrated Christmas. King Richard II of England hosted a Christmas feast in 1377 at which 28 oxen and 300 sheep were eaten. The Yule boar was a common feature of medieval Christmas feasts. Caroling also became popular, and was originally performed by a group of dancers who sang. The group was composed of a lead singer and a ring of dancers that provided the chorus. Various writers of the time condemned caroling as lewd, indicating that the unruly traditions of Saturnalia and Yule may have continued in this form. \"Misrule\"—drunkenness, promiscuity, gambling—was also an important aspect of the festival. In England, gifts were exchanged on New Year's Day, and there was special Christmas ale.\n Christmas during the Middle Ages was a public festival that incorporated ivy, holly, and other evergreens. Christmas gift-giving during the Middle Ages was usually between people with legal relationships, such as tenant and landlord. The annual indulgence in eating, dancing, singing, sporting, and card playing escalated in England, and by the 17th century the Christmas season featured lavish dinners, elaborate masques, and pageants. In 1607, King James I insisted that a play be acted on Christmas night and that the court indulge in games. It was during the Reformation in 16th–17th-century Europe that many Protestants changed the gift bringer to the Christ Child or Christkindl, and the date of giving gifts changed from December 6 to Christmas Eve.\n Following the Protestant Reformation, many of the new denominations, including the Anglican Church and Lutheran Church, continued to celebrate Christmas. In 1629, the Anglican poet John Milton penned On the Morning of Christ's Nativity, a poem that has since been read by many during Christmastide. Donald Heinz, a professor at California State University, Chico, states that Martin Luther \"inaugurated a period in which Germany would produce a unique culture of Christmas, much copied in North America.\" Among the congregations of the Dutch Reformed Church, Christmas was celebrated as one of the principal evangelical feasts.\n However, in 17th century England, some groups such as the Puritans strongly condemned the celebration of Christmas, considering it a Catholic invention and the \"trappings of popery\" or the \"rags of the Beast\". In contrast, the established Anglican Church \"pressed for a more elaborate observance of feasts, penitential seasons, and saints' days. The calendar reform became a major point of tension between the Anglican party and the Puritan party.\" The Catholic Church also responded, promoting the festival in a more religiously oriented form. King Charles I of England directed his noblemen and gentry to return to their landed estates in midwinter to keep up their old-style Christmas generosity. Following the Parliamentarian victory over Charles I during the English Civil War, England's Puritan rulers banned Christmas in 1647.\n Protests followed as pro-Christmas rioting broke out in several cities and for weeks Canterbury was controlled by the rioters, who decorated doorways with holly and shouted royalist slogans. Football, among the sports the Puritans banned on a Sunday, was also used as a rebellious force: when Puritans outlawed Christmas in England in December 1647 the crowd brought out footballs as a symbol of festive misrule. The book, The Vindication of Christmas (London, 1652), argued against the Puritans, and makes note of Old English Christmas traditions, dinner, roast apples on the fire, card playing, dances with \"plow-boys\" and \"maidservants\", old Father Christmas and carol singing. During the ban, semi-clandestine religious services marking Christ's birth continued to be held, and people sang carols in secret.\n It was restored as a legal holiday in England with the Restoration of King Charles II in 1660 when Puritan legislation was declared null and void, with Christmas again freely celebrated in England. Many Calvinist clergymen disapproved of Christmas celebration. As such, in Scotland, the Presbyterian Church of Scotland discouraged the observance of Christmas, and though James VI commanded its celebration in 1618, attendance at church was scant. The Parliament of Scotland officially abolished the observance of Christmas in 1640, claiming that the church had been \"purged of all superstitious observation of days\". Whereas in England, Wales and Ireland Christmas Day is a common law holiday, having been a customary holiday since time immemorial, it was not until 1871 that it was designated a bank holiday in Scotland. Following the Restoration of Charles II, Poor Robin's Almanack contained the lines: \"Now thanks to God for Charles return, / Whose absence made old Christmas mourn. / For then we scarcely did it know, / Whether it Christmas were or no.\" The diary of James Woodforde, from the latter half of the 18th century, details the observance of Christmas and celebrations associated with the season over a number of years.\n As in England, Puritans in Colonial America staunchly opposed the observation of Christmas. The Pilgrims of New England pointedly spent their first December 25 in the New World working normally. Puritans such as Cotton Mather condemned Christmas both because scripture did not mention its observance and because Christmas celebrations of the day often involved boisterous behavior. Many non-Puritans in New England deplored the loss of the holidays enjoyed by the laboring classes in England. Christmas observance was outlawed in Boston in 1659. The ban on Christmas observance was revoked in 1681 by English governor Edmund Andros, but it was not until the mid-19th century that celebrating Christmas became fashionable in the Boston region.\n At the same time, Christian residents of Virginia and New York observed the holiday freely. Pennsylvania Dutch settlers, predominantly Moravian settlers of Bethlehem, Nazareth, and Lititz in Pennsylvania and the Wachovia settlements in North Carolina, were enthusiastic celebrators of Christmas. The Moravians in Bethlehem had the first Christmas trees in America as well as the first Nativity Scenes. Christmas fell out of favor in the United States after the American Revolution, when it was considered an English custom.\nGeorge Washington attacked Hessian (German) mercenaries on the day after Christmas during the Battle of Trenton on December 26, 1776, Christmas being much more popular in Germany than in America at this time.\n With the atheistic Cult of Reason in power during the era of Revolutionary France, Christian Christmas religious services were banned and the three kings cake was renamed the \"equality cake\" under anticlerical government policies.\n In the early 19th century, Christmas festivities and services became widespread with the rise of the Oxford Movement in the Church of England that emphasized the centrality of Christmas in Christianity and charity to the poor, along with Washington Irving, Charles Dickens, and other authors emphasizing family, children, kind-heartedness, gift-giving, and Santa Claus (for Irving), or Father Christmas (for Dickens).\n In the early-19th century, writers imagined Tudor-period Christmas as a time of heartfelt celebration. In 1843, Charles Dickens wrote the novel A Christmas Carol, which helped revive the \"spirit\" of Christmas and seasonal merriment. Its instant popularity played a major role in portraying Christmas as a holiday emphasizing family, goodwill, and compassion.\n Dickens sought to construct Christmas as a family-centered festival of generosity, linking \"worship and feasting, within a context of social reconciliation.\" Superimposing his humanitarian vision of the holiday, in what has been termed \"Carol Philosophy\", Dickens influenced many aspects of Christmas that are celebrated today in Western culture, such as family gatherings, seasonal food and drink, dancing, games, and a festive generosity of spirit. A prominent phrase from the tale, \"Merry Christmas\", was popularized following the appearance of the story. This coincided with the appearance of the Oxford Movement and the growth of Anglo-Catholicism, which led a revival in traditional rituals and religious observances.\n The term Scrooge became a synonym for miser, with the phrase \"Bah! Humbug!\" becoming emblematic of a dismissive attitude of the festive spirit. In 1843, the first commercial Christmas card was produced by Sir Henry Cole. The revival of the Christmas Carol began with William Sandys's Christmas Carols Ancient and Modern (1833), with the first appearance in print of \"The First Noel\", \"I Saw Three Ships\", \"Hark the Herald Angels Sing\" and \"God Rest Ye Merry, Gentlemen\", popularized in Dickens's A Christmas Carol.\n In Britain, the Christmas tree was introduced in the early 19th century by the German-born Queen Charlotte. In 1832, the future Queen Victoria wrote about her delight at having a Christmas tree, hung with lights, ornaments, and presents placed round it. After her marriage to her German cousin Prince Albert, by 1841 the custom became more widespread throughout Britain. An image of the British royal family with their Christmas tree at Windsor Castle created a sensation when it was published in the Illustrated London News in 1848. A modified version of this image was published in Godey's Lady's Book, Philadelphia in 1850. By the 1870s, putting up a Christmas tree had become common in America.\n In America, interest in Christmas had been revived in the 1820s by several short stories by Washington Irving which appear in his The Sketch Book of Geoffrey Crayon, Gent. and \"Old Christmas\". Irving's stories depicted harmonious warm-hearted English Christmas festivities he experienced while staying in Aston Hall, Birmingham, England, that had largely been abandoned, and he used the tract Vindication of Christmas (1652) of Old English Christmas traditions, that he had transcribed into his journal as a format for his stories.\n In 1822, Clement Clarke Moore wrote the poem A Visit From St. Nicholas (popularly known by its first line: Twas the Night Before Christmas). The poem helped popularize the tradition of exchanging gifts, and seasonal Christmas shopping began to assume economic importance. This also started the cultural conflict between the holiday's spiritual significance and its associated commercialism that some see as corrupting the holiday. In her 1850 book The First Christmas in New England, Harriet Beecher Stowe includes a character who complains that the true meaning of Christmas was lost in a shopping spree.\n While the celebration of Christmas was not yet customary in some regions in the U.S., Henry Wadsworth Longfellow detected \"a transition state about Christmas here in New England\" in 1856. \"The old puritan feeling prevents it from being a cheerful, hearty holiday; though every year makes it more so.\" In Reading, Pennsylvania, a newspaper remarked in 1861, \"Even our presbyterian friends who have hitherto steadfastly ignored Christmas—threw open their church doors and assembled in force to celebrate the anniversary of the Savior's birth.\"\n The First Congregational Church of Rockford, Illinois, \"although of genuine Puritan stock\", was 'preparing for a grand Christmas jubilee', a news correspondent reported in 1864. By 1860, fourteen states including several from New England had adopted Christmas as a legal holiday. In 1875, Louis Prang introduced the Christmas card to Americans. He has been called the \"father of the American Christmas card\". On June 28, 1870, Christmas was formally declared a United States federal holiday.\n During the First World War and particularly (but not exclusively) in 1914, a series of informal truces took place for Christmas between opposing armies. The truces, which were organised spontaneously by fighting men, ranged from promises not to shoot (shouted at a distance in order to ease the pressure of war for the day) to friendly socializing, gift giving and even sport between enemies. These incidents became a well known and semi-mythologised part of popular memory. They have been described as a symbol of common humanity even in the darkest of situations and used to demonstrate to children the ideals of Christmas.\n Under the state atheism of the Soviet Union, after its foundation in 1917, Christmas celebrations—along with other Christian holidays—were prohibited in public. During the 1920s, 1930s, and 1940s, the League of Militant Atheists encouraged school pupils to campaign against Christmas traditions, such as the Christmas tree, as well as other Christian holidays, including Easter; the League established an antireligious holiday to be the 31st of each month as a replacement. At the height of this persecution, in 1929, on Christmas Day, children in Moscow were encouraged to spit on crucifixes as a protest against the holiday. Instead, the importance of the holiday and all its trappings, such as the Christmas tree and gift-giving, was transferred to the New Year. It was not until the dissolution of the Soviet Union in 1991 that the persecution ended and Orthodox Christmas became a state holiday again for the first time in Russia after seven decades.\n European History Professor Joseph Perry wrote that likewise, in Nazi Germany, \"because Nazi ideologues saw organized religion as an enemy of the totalitarian state, propagandists sought to deemphasize—or eliminate altogether—the Christian aspects of the holiday\" and that \"Propagandists tirelessly promoted numerous Nazified Christmas songs, which replaced Christian themes with the regime's racial ideologies.\"\n As Christmas celebrations began to spread globally even outside traditional Christian cultures, several Muslim-majority countries began to ban the observance of Christmas, claiming it undermined Islam. In 2023, public Christmas celebrations were cancelled in Bethlehem, the city synonymous with the birth of Jesus. Palestinian leaders of various Christian denominations cited the ongoing Israel–Hamas war in their unanimous decision to cancel celebrations.\n Christmas Day is celebrated as a major festival and public holiday in countries around the world, including many whose populations are mostly non-Christian. In some non-Christian areas, periods of former colonial rule introduced the celebration (e.g. Hong Kong); in others, Christian minorities or foreign cultural influences have led populations to observe the holiday. Countries such as Japan, where Christmas is popular despite there being only a small number of Christians, have adopted many of the cultural aspects of Christmas, such as gift-giving, decorations, and Christmas trees. A similar example is in Turkey, being Muslim-majority and with a small number of Christians, where Christmas trees and decorations tend to line public streets during the festival.\n Many popular customs associated with Christmas developed independently of the commemoration of Jesus's birth, with some claiming that certain elements are Christianized and have origins in pre-Christian festivals that were celebrated by pagan populations who were later converted to Christianity; other scholars reject these claims and affirm that Christmas customs largely developed in a Christian context. The prevailing atmosphere of Christmas has also continually evolved since the holiday's inception, ranging from a sometimes raucous, drunken, carnival-like state in the Middle Ages, to a tamer family-oriented and children-centered theme introduced in a 19th-century transformation. The celebration of Christmas was banned on more than one occasion within certain groups, such as the Puritans and Jehovah's Witnesses (who do not celebrate birthdays in general), due to concerns that it was too unbiblical.\n Prior to and through the early Christian centuries, winter festivals were the most popular of the year in many European pagan cultures. Reasons included the fact that less agricultural work needed to be done during the winter, as well as an expectation of better weather as spring approached. Celtic winter herbs such as mistletoe and ivy, and the custom of kissing under a mistletoe, are common in modern Christmas celebrations in the English-speaking countries.\n The pre-Christian Germanic peoples—including the Anglo-Saxons and the Norse—celebrated a winter festival called Yule, held in the late December to early January period, yielding modern English yule, today used as a synonym for Christmas. In Germanic language-speaking areas, numerous elements of modern Christmas folk custom and iconography may have originated from Yule, including the Yule log, Yule boar, and the Yule goat. Often leading a ghostly procession through the sky (the Wild Hunt), the long-bearded god Odin is referred to as \"the Yule one\" and \"Yule father\" in Old Norse texts, while other gods are referred to as \"Yule beings\". On the other hand, as there are no reliable existing references to a Christmas log prior to the 16th century, the burning of the Christmas block may have been an early modern invention by Christians unrelated to the pagan practice.\n Among countries with a strong Christian tradition, a variety of Christmas celebrations have developed that incorporate regional and local cultures. For example, in eastern Europe Christmas celebrations incorporated pre-Christian traditions such as the Koleda, which shares parallels with the Christmas carol.\n Christmas Day (inclusive of its vigil, Christmas Eve), is a Festival in the Lutheran Churches, a solemnity in the Roman Catholic Church, and a Principal Feast of the Anglican Communion. Other Christian denominations do not rank their feast days but nevertheless place importance on Christmas Eve/Christmas Day, as with other Christian feasts like Easter, Ascension Day, and Pentecost. As such, for Christians, attending a Christmas Eve or Christmas Day church service plays an important part in the recognition of the Christmas season. Christmas, along with Easter, is the period of highest annual church attendance. A 2010 survey by LifeWay Christian Resources found that six in ten Americans attend church services during this time. In the United Kingdom, the Church of England reported an estimated attendance of 2.5 million people at Christmas services in 2015.\n Nativity scenes are known from 10th-century Rome. They were popularised by Saint Francis of Assisi from 1223, quickly spreading across Europe. Different types of decorations developed across the Christian world, dependent on local tradition and available resources, and can vary from simple representations of the crib to far more elaborate sets – renowned manger scene traditions include the colourful Kraków szopka in Poland, which imitate Kraków's historical buildings as settings, the elaborate Italian presepi (Neapolitan [it], Genoese [it] and Bolognese [it]), or the Provençal crèches in southern France, using hand-painted terracotta figurines called santons. In certain parts of the world, notably Sicily, living nativity scenes following the tradition of Saint Francis are a popular alternative to static crèches. The first commercially produced decorations appeared in Germany in the 1860s, inspired by paper chains made by children. In countries where a representation of the Nativity scene is very popular, people are encouraged to compete and create the most original or realistic ones. Within some families, the pieces used to make the representation are considered a valuable family heirloom.\n The traditional colors of Christmas decorations are red, green, and gold. Red symbolizes the blood of Jesus, which was shed in his crucifixion; green symbolizes eternal life, and in particular the evergreen tree, which does not lose its leaves in the winter; and gold is the first color associated with Christmas, as one of the three gifts of the Magi, symbolizing royalty.\n The Christmas tree was first used by German Lutherans in the 16th century, with records indicating that a Christmas tree was placed in the Cathedral of Strassburg in 1539, under the leadership of the Protestant Reformer, Martin Bucer. In the United States, these \"German Lutherans brought the decorated Christmas tree with them; the Moravians put lighted candles on those trees.\" When decorating the Christmas tree, many individuals place a star at the top of the tree symbolizing the Star of Bethlehem, a fact recorded by The School Journal in 1897. Professor David Albert Jones of Oxford University writes that in the 19th century, it became popular for people to also use an angel to top the Christmas tree in order to symbolize the angels mentioned in the accounts of the Nativity of Jesus. Additionally, in the context of a Christian celebration of Christmas, the Christmas tree, being evergreen in colour, is symbolic of Christ, who offers eternal life; the candles or lights on the tree represent the Light of the World—Jesus—born in Bethlehem. Christian services for family use and public worship have been published for the blessing of a Christmas tree, after it has been erected. The Christmas tree is considered by some as Christianisation of pagan tradition and ritual surrounding the Winter Solstice, which included the use of evergreen boughs, and an adaptation of pagan tree worship; according to eighth-century biographer Æddi Stephanus, Saint Boniface (634–709), who was a missionary in Germany, took an ax to an oak tree dedicated to Thor and pointed out a fir tree, which he stated was a more fitting object of reverence because it pointed to heaven and it had a triangular shape, which he said was symbolic of the Trinity. The English language phrase \"Christmas tree\" is first recorded in 1835 and represents an importation from the German language.\n Since the 16th century, the poinsettia, a native plant from Mexico, has been associated with Christmas carrying the Christian symbolism of the Star of Bethlehem; in that country it is known in Spanish as the Flower of the Holy Night. Other popular holiday plants include holly, mistletoe, red amaryllis, and Christmas cactus.\n Other traditional decorations include bells, candles, candy canes, stockings, wreaths, and angels. Both the displaying of wreaths and candles in each window are a more traditional Christmas display. The concentric assortment of leaves, usually from an evergreen, make up Christmas wreaths and are designed to prepare Christians for the Advent season. Candles in each window are meant to demonstrate the fact that Christians believe that Jesus Christ is the ultimate light of the world.\n Christmas lights and banners may be hung along streets, music played from speakers, and Christmas trees placed in prominent places. It is common in many parts of the world for town squares and consumer shopping areas to sponsor and display decorations. Rolls of brightly colored paper with secular or religious Christmas motifs are manufactured for the purpose of wrapping gifts. In some countries, Christmas decorations are traditionally taken down on Twelfth Night.\n For the Christian celebration of Christmas, the viewing of the Nativity play is one of the oldest Christmastime traditions, with the first reenactment of the Nativity of Jesus taking place in 1223 AD in the Italian town of Greccio. In that year, Francis of Assisi assembled a Nativity scene outside of his church in Italy and children sung Christmas carols celebrating the birth of Jesus. Each year, this grew larger and people travelled from afar to see Francis's depiction of the Nativity of Jesus that came to feature drama and music. Nativity plays eventually spread throughout all of Europe, where they remain popular. Christmas Eve and Christmas Day church services often came to feature Nativity plays, as did schools and theatres. In France, Germany, Mexico and Spain, Nativity plays are often reenacted outdoors in the streets.\n The earliest extant specifically Christmas hymns appear in fourth-century Rome. Latin hymns such as \"Veni redemptor gentium\", written by Ambrose, Archbishop of Milan, were austere statements of the theological doctrine of the Incarnation in opposition to Arianism. \"Corde natus ex Parentis\" (\"Of the Father's love begotten\") by the Spanish poet Prudentius (died 413) is still sung in some churches today. In the 9th and 10th centuries, the Christmas \"Sequence\" or \"Prose\" was introduced in North European monasteries, developing under Bernard of Clairvaux into a sequence of rhymed stanzas. In the 12th century the Parisian monk Adam of St. Victor began to derive music from popular songs, introducing something closer to the traditional Christmas carol. Christmas carols in English appear in a 1426 work of John Awdlay who lists twenty five \"caroles of Cristemas\", probably sung by groups of 'wassailers', who went from house to house.\n The songs now known specifically as carols were originally communal folk songs sung during celebrations such as \"harvest tide\" as well as Christmas. It was only later that carols began to be sung in church. Traditionally, carols have often been based on medieval chord patterns, and it is this that gives them their uniquely characteristic musical sound. Some carols like \"Personent hodie\", \"Good King Wenceslas\", and \"In dulci jubilo\" can be traced directly back to the Middle Ages. They are among the oldest musical compositions still regularly sung. \"Adeste Fideles\" (O Come all ye faithful) appeared in its current form in the mid-18th century.\n The singing of carols increased in popularity after the Protestant Reformation in the Lutheran areas of Europe, as the Reformer Martin Luther wrote carols and encouraged their use in worship, in addition to spearheading the practice of caroling outside the Mass. The 18th-century English reformer Charles Wesley, a founder of Methodism, understood the importance of music to Christian worship. In addition to setting many psalms to melodies, he wrote texts for at least three Christmas carols. The best known was originally entitled \"Hark! How All the Welkin Rings\", later renamed \"Hark! The Herald Angels Sing\".\n Christmas seasonal songs of a secular nature emerged in the late 18th century. The Welsh melody for \"Deck the Halls\" dates from 1794, with the lyrics added by Scottish musician Thomas Oliphant in 1862, and the American \"Jingle Bells\" was copyrighted in 1857. Other popular carols include \"The First Noel\", \"God Rest You Merry, Gentlemen\", \"The Holly and the Ivy\", \"I Saw Three Ships\", \"In the Bleak Midwinter\", \"Joy to the World\", \"Once in Royal David's City\" and \"While Shepherds Watched Their Flocks\". In the 19th and 20th centuries, African American spirituals and songs about Christmas, based in their tradition of spirituals, became more widely known. An increasing number of seasonal holiday songs were commercially produced in the 20th century, including jazz and blues variations. In addition, there was a revival of interest in early music, from groups singing folk music, such as The Revels, to performers of early medieval and classical music.\n One of the most ubiquitous festive songs is \"We Wish You a Merry Christmas\", which originates from the West Country of England in the 1930s. Radio has covered Christmas music from variety shows from the 1940s and 1950s, as well as modern-day stations that exclusively play Christmas music from late November through December 25. Hollywood movies have featured new Christmas music, such as \"White Christmas\" in Holiday Inn and Rudolph the Red-Nosed Reindeer. Traditional carols have also been included in Hollywood films, such as \"Hark! The Herald Angels Sing\" in It's a Wonderful Life (1946), and \"Silent Night\" in A Christmas Story.\n A special Christmas family meal is traditionally an important part of the holiday's celebration, and the food served varies greatly from country to country. Some regions have special meals for Christmas Eve, such as Sicily, where 12 kinds of fish are served. In the United Kingdom and countries influenced by its traditions, a standard Christmas meal includes turkey, goose or other large bird, gravy, potatoes, vegetables, sometimes bread, and cider. Special desserts are also prepared, such as Christmas pudding, mince pies, fruit cake and Yule log cake.\n In Poland, other parts of Eastern Europe, and Scandinavia, fish is often used for the traditional main course, but richer meat such as lamb is increasingly served. In Sweden, it is common with a special variety of smörgåsbord, where ham, meatballs, and herring play a prominent role. In Germany, France, and Austria, goose and pork are favored. Beef, ham, and chicken in various recipes are popular worldwide. The Maltese traditionally serve Imbuljuta tal-Qastan, a chocolate and chestnuts beverage, after Midnight Mass and throughout the Christmas season. Slovenes prepare the traditional Christmas bread potica, bûche de Noël in France, panettone in Italy, and elaborate tarts and cakes. The eating of sweets and chocolates has become popular worldwide, and sweeter Christmas delicacies include the German stollen, marzipan cake or candy, and Jamaican rum fruit cake. As one of the few fruits traditionally available to northern countries in winter, oranges have been long associated with special Christmas foods. Eggnog is a sweetened dairy-based beverage traditionally made with milk, cream, sugar, and whipped eggs (which gives it a frothy texture). Spirits such as brandy, rum, or bourbon are often added. The finished serving is often garnished with a sprinkling of ground cinnamon or nutmeg.\n Christmas cards are illustrated messages of greeting exchanged between friends and family members during the weeks preceding Christmas Day. The traditional greeting reads \"wishing you a Merry Christmas and a Happy New Year\", much like that of the first commercial Christmas card, produced by Sir Henry Cole in London in 1843. The custom of sending them has become popular among a wide cross-section of people with the emergence of the modern trend towards exchanging E-cards.\n Christmas cards are purchased in considerable quantities and feature artwork, commercially designed and relevant to the season. The content of the design might relate directly to the Christmas narrative, with depictions of the Nativity of Jesus, or Christian symbols such as the Star of Bethlehem, or a white dove, which can represent both the Holy Spirit and Peace on Earth. Other Christmas cards are more secular and can depict Christmas traditions, mythical figures such as Santa Claus, objects directly associated with Christmas such as candles, holly, and baubles, or a variety of images associated with the season, such as Christmastide activities, snow scenes, and the wildlife of the northern winter.\n Some prefer cards with a poem, prayer, or Biblical verse; while others distance themselves from religion with an all-inclusive \"Season's greetings\".\n A number of nations have issued commemorative stamps at Christmastide. Postal customers will often use these stamps to mail Christmas cards, and they are popular with philatelists. These stamps are regular postage stamps, unlike Christmas seals, and are valid for postage year-round. They usually go on sale sometime between early October and early December and are printed in considerable quantities.\n Christmas seals were first issued to raise funding to fight and bring awareness to tuberculosis. The first Christmas seal was issued in Denmark in 1904, and since then other countries have issued their own Christmas seals.\n The exchanging of gifts is one of the core aspects of the modern Christmas celebration, making it the most profitable time of year for retailers and businesses throughout the world. On Christmas, people exchange gifts based on the Christian tradition associated with Saint Nicholas, and the gifts of gold, frankincense, and myrrh which were given to the baby Jesus by the Magi. The practice of gift giving in the Roman celebration of Saturnalia may have influenced Christian customs, but on the other hand the Christian \"core dogma of the Incarnation, however, solidly established the giving and receiving of gifts as the structural principle of that recurrent yet unique event\", because it was the Biblical Magi, \"together with all their fellow men, who received the gift of God through man's renewed participation in the divine life.\" However, Thomas J. Talley holds that the Roman Emperor Aurelian placed the alternate festival on December 25 in order to compete with the growing rate of the Christian Church, which had already been celebrating Christmas on that date first.\n A number of figures are associated with Christmas and the seasonal giving of gifts. Among these are Father Christmas, also known as Santa Claus (derived from the Dutch for Saint Nicholas), Père Noël, and the Weihnachtsmann; Saint Nicholas or Sinterklaas; the Christkind; Kris Kringle; Joulupukki; tomte/nisse; Babbo Natale; Saint Basil; and Ded Moroz. The Scandinavian tomte (also called nisse) is sometimes depicted as a gnome instead of Santa Claus.\n The best known of these figures today is red-dressed Santa Claus, of diverse origins. The name 'Santa Claus' can be traced back to the Dutch Sinterklaas ('Saint Nicholas'). Nicholas was a 4th-century Greek bishop of Myra, a city in the Roman province of Lycia, whose ruins are 3 kilometres (1.9 mi) from modern Demre in southwest Turkey. Among other saintly attributes, he was noted for the care of children, generosity, and the giving of gifts. His feast day, December 6, came to be celebrated in many countries with the giving of gifts.\n Saint Nicholas traditionally appeared in bishop's attire, accompanied by helpers, inquiring about the behaviour of children during the past year before deciding whether they deserved a gift or not. By the 13th century, Saint Nicholas was well known in the Netherlands, and the practice of gift-giving in his name spread to other parts of central and southern Europe. At the Reformation in 16th- and 17th-century Europe, many Protestants changed the gift bringer to the Christ Child or Christkindl, corrupted in English to 'Kris Kringle', and the date of giving gifts changed from December 6 to Christmas Eve.\n The modern popular image of Santa Claus, however, was created in the United States, and in particular in New York. The transformation was accomplished with the aid of notable contributors including Washington Irving and the German-American cartoonist Thomas Nast (1840–1902). Following the American Revolutionary War, some of the inhabitants of New York City sought out symbols of the city's non-English past. New York had originally been established as the Dutch colonial town of New Amsterdam and the Dutch Sinterklaas tradition was reinvented as Saint Nicholas.\n Current tradition in several Latin American countries (such as Venezuela and Colombia) holds that while Santa makes the toys, he then gives them to the Baby Jesus, who is the one who actually delivers them to the children's homes, a reconciliation between traditional religious beliefs and the iconography of Santa Claus imported from the United States.\n In Italy's South Tyrol, Austria, the Czech Republic, Southern Germany, Hungary, Liechtenstein, Slovakia, and Switzerland, the Christkind (Ježíšek in Czech, Jézuska in Hungarian and Ježiško in Slovak) brings the presents. Greek children get their presents from Saint Basil on New Year's Eve, the eve of that saint's liturgical feast. The German St. Nikolaus is not identical with the Weihnachtsmann (who is the German version of Santa Claus / Father Christmas). St. Nikolaus wears a bishop's dress and still brings small gifts (usually candies, nuts, and fruits) on December 6 and is accompanied by Knecht Ruprecht. Although many parents around the world routinely teach their children about Santa Claus and other gift bringers, some have come to reject this practice, considering it deceptive.\n Multiple gift-giver figures exist in Poland, varying between regions and individual families. St Nicholas (Święty Mikołaj) dominates Central and North-East areas, the Starman (Gwiazdor) is most common in Greater Poland, Baby Jesus (Dzieciątko) is unique to Upper Silesia, with the Little Star (Gwiazdka) and the Little Angel (Aniołek) being common in the South and the South-East. Grandfather Frost (Dziadek Mróz) is less commonly accepted in some areas of Eastern Poland. It is worth noting that across all of Poland, St Nicholas is the gift giver on Saint Nicholas Day on December 6.\n Christmas during the Middle Ages was a public festival with annual indulgences included the sporting. When Puritans outlawed Christmas in England in December 1647 the crowd brought out footballs as a symbol of festive misrule. The Orkney Christmas Day Ba' tradition continues. In the former top tier of English football, home and away Christmas Day and Boxing Day double headers were often played guaranteeing football clubs large crowds by allowing many working people their only chance to watch a game. Champions Preston North End faced Aston Villa on Christmas Day 1889 and the last December 25 fixture was in 1965 in England, Blackpool beating Blackburn Rovers 4–2. One of the most memorable images of the Christmas truce during World War I was the games of football played between the opposing sides on Christmas Day 1914.\n More recently, in the United States, both NFL and NBA have held fixtures on Christmas Day.\n There are two main theories behind December 25 becoming the traditional date for Christmas, although Theology professor Susan Roll says that \"No liturgical historian [...] goes so far as to deny that it has any sort of relation with the sun, the winter solstice and the popularity of solar worship in the later Roman Empire\". December 25 was the date of the winter solstice in the Roman calendar. Some early Christian writers noted the solar symbolism in placing Jesus's birthday at the winter solstice and John's birthday at the summer solstice.\n The 'history of religions' theory suggests the Church chose December 25 as Christ's birthday (dies Natalis Christi) to appropriate the Roman winter solstice festival dies Natalis Solis Invicti (birthday of Sol Invictus, the 'Invincible Sun'), held on this date since 274 AD. The early Church linked Jesus Christ to the Sun and referred to him as the 'Sun of Righteousness' (Sol Justitiae) prophesied by Malachi. Gary Forsythe, Professor of Ancient History, says that the Natalis Solis Invicti followed \"the seven-day period of the Saturnalia (December 17–23), Rome's most joyous holiday season since Republican times, characterized by parties, banquets, and exchanges of gifts\".\n Another theory, the 'computation hypothesis' or 'calculation theory', notes that December 25 is nine months after March 25, a date chosen as Jesus's conception (the Annunciation) and the date of the spring equinox on the Roman calendar.\n Some jurisdictions of the Eastern Orthodox Church, including those of Russia, Georgia, Macedonia, Montenegro, Serbia, and Jerusalem, mark feasts using the older Julian calendar. As of 2024[update], there is a difference of 13 days between the Julian calendar and the modern Gregorian calendar, which is used internationally for most secular purposes. As a result, December 25 on the Julian calendar currently corresponds to January 7 on the calendar used by most governments and people in everyday life. Therefore, the aforementioned Orthodox Christians mark December 25 (and thus Christmas) on the day that is internationally considered to be January 7.\n However, following the Council of Constantinople in 1923, other Orthodox Christians, such as those belonging to the jurisdictions of Constantinople, Bulgaria, Greece, Romania, Antioch, Alexandria, Albania, Cyprus, Finland, and the Orthodox Church in America, among others, began using the Revised Julian calendar, which at present corresponds exactly to the Gregorian calendar. Therefore, these Orthodox Christians mark December 25 (and thus Christmas) on the same day that is internationally considered to be December 25.\n A further complication is added by the fact that the Armenian Apostolic Church continues the original ancient Eastern Christian practice of celebrating the birth of Christ not as a separate holiday, but on the same day as the celebration of his baptism (Theophany), which is on January 6. This is a public holiday in Armenia, and it is held on the same day that is internationally considered to be January 6, because since 1923 the Armenian Church in Armenia has used the Gregorian calendar.\n However, there is also a small Armenian Patriarchate of Jerusalem, which maintains the traditional Armenian custom of celebrating the birth of Christ on the same day as Theophany (January 6), but uses the Julian calendar for the determination of that date. As a result, this church celebrates \"Christmas\" (more properly called Theophany) on the day that is considered January 19 on the Gregorian calendar in use by the majority of the world.\n Following the 2022 invasion of its territory by Russia, Ukraine officially moved its Christmas date from January 7 to December 25, to distance itself from the Russian Orthodox Church that had supported Russia's invasion. This followed the Orthodox Church of Ukraine formally adopting the Revised Julian calendar for fixed feasts and solemnities.\n There are four different dates used by different Christian groups to mark the birth of Christ, given in the table below.\n In September 2024, Venezuelan president Nicolás Maduro declared Christmas to be brought forward from December 25 to October 1.\n Christmas is typically a peak selling season for retailers in many nations around the world since sales increase dramatically during this time as people purchase gifts, decorations, and supplies to celebrate. In the United States, the \"Christmas shopping season\" starts as early as October. In Canada, merchants begin advertising campaigns just before Halloween (October 31), and step up their marketing following Remembrance Day on November 11. In the UK and Ireland, the Christmas shopping season starts from mid-November, around the time when high street Christmas lights are turned on. A concept devised by retail entrepreneur David Lewis, the first Christmas grotto opened in Lewis's department store in Liverpool, England in 1879. In the United States, it has been calculated that a quarter of all personal spending takes place during the Christmas/holiday shopping season. Figures from the US Census Bureau reveal that expenditure in department stores nationwide rose from $20.8 billion in November 2004 to $31.9 billion in December 2004, an increase of 54 percent. In other sectors, the pre-Christmas increase in spending was even greater, there being a November–December buying surge of 100 percent in bookstores and 170 percent in jewelry stores. In the same year employment in American retail stores rose from 1.6 million to 1.8 million in the two months leading up to Christmas. Industries completely dependent on Christmas include Christmas cards, of which 1.9 billion are sent in the United States each year, and live Christmas trees, of which 20.8 million were cut in the US in 2002. For 2019, the average US adult was projected to spend $920 on gifts alone. In the UK in 2010, up to £8 billion was expected to be spent online at Christmas, approximately a quarter of total retail festive sales.\n In most Western nations, Christmas Day is the least active day of the year for business and commerce; almost all retail, commercial and institutional businesses are closed, and almost all industries cease activity (more than any other day of the year), whether laws require such or not. In England and Wales, the Christmas Day (Trading) Act 2004 prevents all large shops from trading on Christmas Day. Similar legislation was approved in Scotland in 2007. Film studios release many high-budget movies during the holiday season, including Christmas films, fantasy movies or high-tone dramas with high production values to hopes of maximizing the chance of nominations for the Academy Awards.\n One economist's analysis calculates that, despite increased overall spending, Christmas is a deadweight loss under orthodox microeconomic theory, because of the effect of gift-giving. This loss is calculated as the difference between what the gift giver spent on the item and what the gift receiver would have paid for the item. It is estimated that in 2001, Christmas resulted in a $4 billion deadweight loss in the US alone. Because of complicating factors, this analysis is sometimes used to discuss possible flaws in current microeconomic theory. Other deadweight losses include the effects of Christmas on the environment and the fact that material gifts are often perceived as white elephants, imposing cost for upkeep and storage and contributing to clutter.\n Christmas has at times been the subject of controversy and attacks from various sources, both Christian and non-Christian. Historically, it was prohibited by Puritans during their ascendency in the Commonwealth of England (1647–1660), and in Colonial New England where the Puritans outlawed the celebration of Christmas in 1659 on the grounds that Christmas was not mentioned in Scripture and therefore violated the Reformed regulative principle of worship. The Parliament of Scotland, which was dominated by Presbyterians, passed a series of acts outlawing the observance of Christmas between 1637 and 1690; Christmas Day did not become a public holiday in Scotland until 1871. Today, some conservative Reformed denominations such as the Free Presbyterian Church of Scotland and the Reformed Presbyterian Church of North America likewise reject the celebration of Christmas based on the regulative principle and what they see as its non-Scriptural origin. Christmas celebrations have also been prohibited by atheist states such as the Soviet Union and more recently majority Muslim states such as Somalia, Tajikistan and Brunei.\n Some Christians and organizations such as Pat Robertson's American Center for Law and Justice cite alleged attacks on Christmas (dubbing them a \"war on Christmas\"). Such groups claim that any specific mention of the term \"Christmas\" or its religious aspects is being increasingly censored, avoided, or discouraged by a number of advertisers, retailers, government (prominently schools), and other public and private organizations. One controversy is the occurrence of Christmas trees being renamed Holiday trees. In the U.S. there has been a tendency to replace the greeting Merry Christmas with Happy Holidays, which is considered inclusive at the time of the Jewish celebration of Hanukkah. In the U.S. and Canada, where the use of the term \"Holidays\" is most prevalent, opponents have denounced its usage and avoidance of using the term \"Christmas\" as being politically correct. In 1984, the U.S. Supreme Court ruled in Lynch v. Donnelly that a Christmas display (which included a Nativity scene) owned and displayed by the city of Pawtucket, Rhode Island, did not violate the First Amendment. American Muslim scholar Abdul Malik Mujahid has said that Muslims must treat Christmas with respect, even if they disagree with it.\n The government of the People's Republic of China officially espouses state atheism, and has conducted antireligious campaigns to this end. In December 2018, officials raided Christian churches prior to Christmastide and coerced them to close; Christmas trees and Santa Clauses were also forcibly removed.\n",
        "source_url": "https://en.wikipedia.org/wiki/Christmas"
    }
]